5.Resources/Hall_Implementation_openFOAM/Z1flatanalytical/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
	
    cyclic1
    {
        type            cyclic;
    }
	
    cyclic2
    {
        type            cyclic;
    }

    outlet
    {
        type            zeroGradient;
	}
	
    inlet
    {
        type			fixedValue;	
	    value			uniform (100 0 0);         
    }
}


// ************************************************************************* //
